files/astronomy/public/hydro-and-code.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-28 Fri 15:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChongChong He" />
<link rel="stylesheet" href="css/org.css" type="text/css" />
<link rel="stylesheet" href="css/custom.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org553b4e0">1. Hydrodynamics</a>
<ul>
<li><a href="#org7316285">1.1. Hydrodynamic equations</a></li>
<li><a href="#subsec:time">1.2. Time Scales</a>
<ul>
<li><a href="#free-fall-time">1.2.1. Free fall time</a></li>
<li><a href="#sound-speed">1.2.2. Sound speed</a></li>
<li><a href="#alfven-wave">1.2.3. Alfven wave</a></li>
<li><a href="#velocity-dispersion">1.2.4. Velocity dispersion</a></li>
</ul>
</li>
<li><a href="#jeans-mass">1.3. Jeans Mass</a></li>
<li><a href="#subsec:bondi">1.4. Bondi Accretion</a>
<ul>
<li>
<ul>
<li><a href="#hoyle-and-lyttleton-accretion">1.4.0.1. Hoyle and Lyttleton accretion</a></li>
<li><a href="#bondi-accretion">1.4.0.2. Bondi Accretion</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#subsec:other">1.5. Other topics</a>
<ul>
<li><a href="#org47f92d5">1.5.1. Viscosity</a></li>
<li><a href="#reynolds-number">1.5.2. Reynolds Number</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9e55275">2. MHD</a>
<ul>
<li><a href="#orgfa902cd">2.1. MHD</a></li>
</ul>
</li>
<li><a href="#hydrodynamic Al-simulations">3. Codes</a>
<ul>
<li><a href="#methods-and-code">3.1. Hydro Methods and Codes, Summary</a></li>
<li><a href="#sec:ramses">3.2. RAMSES</a>
<ul>
<li><a href="#summary">3.2.1. Summary</a></li>
<li><a href="#features">3.2.2. Features</a></li>
<li><a href="#m1-closure">3.2.3. M1 closure</a></li>
<li><a href="#cooling-function">3.2.4. Cooling Function</a>
<ul>
<li><a href="#orgf389363">3.2.4.1. Thermal update</a></li>
<li><a href="#orgf89dfe9">3.2.4.2. In code</a></li>
<li><a href="#orge644929">3.2.4.3. Other notes</a></li>
</ul>
</li>
<li><a href="#org5fecfab">3.2.5. Sink particles</a></li>
</ul>
</li>
<li><a href="#n-body">3.3. N-body</a></li>
<li><a href="#hydro">3.4. Hydro Codes</a>
<ul>
<li><a href="#orgb66a838">3.4.1. Fire</a></li>
<li><a href="#org677fc9a">3.4.2. </a></li>
</ul>
</li>
<li><a href="#observations">3.5. Mock Observations</a>
<ul>
<li><a href="#stellar-population-sythesis">3.5.1. Stellar population sythesis</a></li>
<li><a href="#filters">3.5.2. Filters</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org166d59f">4. Simulation Projects</a>
<ul>
<li><a href="#org8fa54d5">4.1. FIRE: Feedback In Realistic Environments</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="HTML" id="orgd03aa4b">
<p>
\(
	  \newcommand{\dif}{\,\mathrm{d}}
	  \newcommand{\sci}[2]{#1 \times 10^{#2}}
	  \def\num#1{\numx#1}\def\numx#1e#2{{#1}\mathrm{e}{#2}}
	  \newcommand{\msun}{{\rm M}_\odot}
	  \newcommand{\si}[1]{{\rm #1}}
\)
</p>

</div>

<div id="outline-container-org553b4e0" class="outline-2">
<h2 id="org553b4e0"><span class="section-number-2">1</span> Hydrodynamics</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7316285" class="outline-3">
<h3 id="org7316285"><span class="section-number-3">1.1</span> Hydrodynamic equations</h3>
<div class="outline-text-3" id="text-1-1">
<p>
My notes: "Notability::Research:Topics:19. Fluid dynamics"
</p>

<p>
<b>Summary</b>
We introduce a <i>material derivative</i> \(D/Dt = \partial/\partial t + \mathbf{v} \cdot \nabla\). It is the derivative following the gas flow, defined as \(D Q / Dt = \frac{Q(t+\delta t, {\bf x} + {\bf v}\delta t) - Q(t, {\bf x})}{\delta t}\). Then, the <i>Euler equations of fluid</i> is easily represented as
</p>
\begin{align}
\frac{D \rho}{D t} &= - \rho \nabla \cdot {\bf v} \\
\frac{D {\bf v}}{D t} &= - \frac{\nabla p}{\rho} + {\bf g} \\
\frac{D e}{D t} &= - \frac{\nabla \cdot (p {\bf v})}{\rho}
\end{align}
<p>
The first equation, the equation of continuity, can be derived by inspecting a volume of fluid, in which the outflow rate equals the change in mass, and we obtain \(\partial \rho / \partial t + \nabla \cdot (\rho {\bf v}) = 0\). The conversion between the two different form can be acheived by using the expansion of \(\nabla \cdot (\rho {\bf v})\). 
</p>
</div>
</div>

<div id="outline-container-subsec:time" class="outline-3">
<h3 id="subsec:time"><span class="section-number-3">1.2</span> Time Scales</h3>
<div class="outline-text-3" id="text-subsec:time">
</div>

<div id="outline-container-free-fall-time" class="outline-4">
<h4 id="free-fall-time"><span class="section-number-4">1.2.1</span> Free fall time</h4>
<div class="outline-text-4" id="text-free-fall-time">
<p>
Assume mean molecular weight \(\mu = 1.4\), the global free-fall time of a
cloud with particle number density \(n\) is given by \[\label{eq:ff}
t_{{\rm ff}} = \sqrt{\frac{3\pi}{32G\rho_{0}}} \approx 1.376~{\rm Myr}
\cdot \left(\frac{n}{10^3 \si{cm^{-3}}}\right)^{-1/2}\]
</p>
</div>
</div>

<div id="outline-container-sound-speed" class="outline-4">
<h4 id="sound-speed"><span class="section-number-4">1.2.2</span> Sound speed</h4>
<div class="outline-text-4" id="text-sound-speed">
<p>
The <i>sound speed</i> is given by
\[
c_{s}=\sqrt{\frac{\gamma p_{0}}{\rho_{0}}}
= \sqrt{\frac{\gamma kT}{\mu m_{H}}}
\]
The <i>isothermal sound speed</i> is therefore
\[
c_s = \sqrt{\frac{kT}{\mu m_{H}}} = 0.29\,\si{km/s} \; \left( \frac{T_1}{\mu} \right)^{1/2} = 9.1\,\si{km/s} \; \left( \frac{T_4}{\mu} \right)^{1/2} 
\]
where \(\mu\) is the mean particle weight. Note that for ionized hydrogen, \(\mu = 0.5\) and \(c_s = 13\,\si{km/s}\) at \(10^4\) K.
</p>
</div>
</div>

<div id="outline-container-alfven-wave" class="outline-4">
<h4 id="alfven-wave"><span class="section-number-4">1.2.3</span> Alfven wave</h4>
<div class="outline-text-4" id="text-alfven-wave">
<p>
<i>(Need to learn)</i> The Alfven velocity is given by
\(v_{{\rm A}}=B_{0}/\sqrt{4\pi\rho_{0}}\) (in cgs). Therefore, the Alfven
wave crossing time is
\(t_{{\rm act}}=L/v_{{\rm A}}=L\sqrt{4\pi\rho_{0}}/B_{0}\).
</p>

<p>
In He et al. (2019), and , therefore \(v_A / \sigma\) = 0.2, where
\(\sigma\) is the turbulence velocity dispersion.
</p>
</div>
</div>

<div id="outline-container-velocity-dispersion" class="outline-4">
<h4 id="velocity-dispersion"><span class="section-number-4">1.2.4</span> Velocity dispersion</h4>
<div class="outline-text-4" id="text-velocity-dispersion">
</div>
</div>
</div>

<div id="outline-container-jeans-mass" class="outline-3">
<h3 id="jeans-mass"><span class="section-number-3">1.3</span> Jeans Mass</h3>
<div class="outline-text-3" id="text-jeans-mass">
<p>
\[M_{\rm J} \equiv \frac{4\pi}{3}\lambda_{\rm J}^3 \rho
  \approx 20 \msun \cdot \left( \frac{T}{10 {\rm K}}
  \right)^{3/2} \left( \frac{n}{100\,{\rm cm}^{-3}} \right) ^{-1/2}\]
</p>
</div>
</div>


<div id="outline-container-subsec:bondi" class="outline-3">
<h3 id="subsec:bondi"><span class="section-number-3">1.4</span> Bondi Accretion</h3>
<div class="outline-text-3" id="text-subsec:bondi">
</div>

<div id="outline-container-hoyle-and-lyttleton-accretion" class="outline-5">
<h5 id="hoyle-and-lyttleton-accretion"><span class="section-number-5">1.4.0.1</span> Hoyle and Lyttleton accretion</h5>
<div class="outline-text-5" id="text-hoyle-and-lyttleton-accretion">
<p>
A star moving through gas cloud. Assuming a ballistic orbit for accreted
particles, we get a impact factor \[\label{eq:1}
\zeta_{HL} = \frac{2GM}{v_{\infty}^2}.\] and accretion rate (mass flux)
\[\label{eq:1}
\dot{M}_{HL} = \pi \zeta_{HL}^2 v_{\infty} \rho_{\infty} = \frac{4\pi G^2M^2\rho_{\infty}}{v_{\infty}^3}.\]
</p>
</div>
</div>

<div id="outline-container-bondi-accretion" class="outline-5">
<h5 id="bondi-accretion"><span class="section-number-5">1.4.0.2</span> Bondi Accretion</h5>
<div class="outline-text-5" id="text-bondi-accretion">
<p>
A Bondi radius may be defined as \[r_B = \frac{GM}{c_{s}^2(r_B)}\] Flow
outside is subsonic and the density is almost uniform. This ends up with
a Bondi accretion rate
\[\dot{M}_B = 4 \pi r_B^2 c_s \rho_{\infty} = \frac{4\pi
    G^{2}M^{2}\rho_{\infty}}{c_s^{3}}\] And interpolation formula would
be \[\label{eq:bondi}
\dot{M}_B = 4 \pi r_B^2 c_s \rho_{\infty} = \frac{4\pi
  G^{2}M^{2}\rho_{\infty}}{(c_\infty^2 + v_{\infty}^2)^{3/2} }.\]
</p>
</div>
</div>
</div>

<div id="outline-container-subsec:other" class="outline-3">
<h3 id="subsec:other"><span class="section-number-3">1.5</span> Other topics</h3>
<div class="outline-text-3" id="text-subsec:other">
</div>

<div id="outline-container-org47f92d5" class="outline-4">
<h4 id="org47f92d5"><span class="section-number-4">1.5.1</span> Viscosity</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
<b>Definition of viscosity</b>: The fource \(F\) acting on the top plate of a fluid is proportional to the gradient of the speed \(u\) and the area \(A\) of the plate:
\[
F = \mu A \frac{\partial u}{\partial y},
\]
\(\mu\) is the <i>dynamic viscosity</i> of the fluid, with units of Pa s (pascal-second). The <i>kinematic viscosity</i> is defined as the ratio fo the viscosity \(\mu\) to the fluid density:
\[
\nu = \frac{\mu}{\rho},
\]
with the dimension of \(L^2/T\). 
</p>
</div>
</div>

<div id="outline-container-reynolds-number" class="outline-4">
<h4 id="reynolds-number"><span class="section-number-4">1.5.2</span> Reynolds Number</h4>
<div class="outline-text-4" id="text-reynolds-number">
<p>
\(\mathcal{R}=LV/\nu\), where \(L\) is the typical length of the object, \(V\) is the typical fluid velocity, and \(\nu\) is the viscosity of the fluid. Imagine two different fluid flows around two geometrically similar objects. If these two systems have the same Reynolds number, then the flow patterns should be similar. This is called the law of similarity (Reynolds 1883). Systems with low Reynolds number are dominated by viscosity.
</p>

<p>
There is also the <i>magnetic Reynolds number</i> where the vescosity is replaced with the magnetic diffusivity \(\lambda = c^2 / 4 \pi \sigma\). See Sec. 14.2 of of Choudhuri (1998). 
</p>
</div>
</div>
</div>
</div>
