files/astronomy/public/hydro-and-code.html

<div id="outline-container-org9e55275" class="outline-2">
<h2 id="org9e55275"><span class="section-number-2">2</span> MHD</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfa902cd" class="outline-3">
<h3 id="orgfa902cd"><span class="section-number-3">2.1</span> MHD</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Within the confines of the magnnetohydrodynamics of a single-component condducting fluid, the material effects of electromagnetic fields enter as two terms:
</p>
<blockquote>
<p>
Lorentz force per unit volume: \({\bf j} \times {\bf B} / c = (\nabla \times {\bf B}) \times {\bf B} / 4\pi\).<br />
Heat production per volume by Ohmic dissipation: \(j^2 / \sigma = \eta | \nabla \times {\bf B} |^2 / 4\pi\)  
</p>
</blockquote>

<p>
Therefore, the equation of continuity is not changed; the equation of motion has to change by adding a magnetic body force, \({\bf j} \times {\bf B} / \rho c\), where \({\bf j} = (c/4\pi) \nabla \times {\bf B}\)  is the electric current density. The energy equation has to add an <i>Ohmic heating</i> term, \({\bf j}^2 / \sigma\) 
</p>

<p>
Reference: Sec. 14.1 of Choudhuri (1998); page 302 of Shu, F. "Gas Dynamics".
</p>
</div>
</div>
</div>

<div id="outline-container-hydrodynamic Al-simulations" class="outline-2">
<h2 id="hydrodynamic Al-simulations"><span class="section-number-2">3</span> Codes</h2>
<div class="outline-text-2" id="text-hydrodynamic Al-simulations">
</div>

<div id="outline-container-methods-and-code" class="outline-3">
<h3 id="methods-and-code"><span class="section-number-3">3.1</span> Hydro Methods and Codes, Summary</h3>
<div class="outline-text-3" id="text-methods-and-code">
<p>
Specification of the flow field:
</p>

<ul class="org-ul">
<li>Euler approach: The fluid properties are written as functions of space and times. Cons: limited dynamic range.</li>

<li>Lagrangian approach: Pieces of the fluid are "tagged". The fluid flow properties are determined by tracking the motion and properties of the particles as they move in time.</li>

<li>Smooth Particles Hydrodynamics (SPH): an intermediate solution. Follows the Lagrangian evolution of the flow, in which resolution elements are defined as appropriate averages over 50 neighboring particles.</li>
</ul>

<p>
Methods of N-body code:
</p>

<ul class="org-ul">
<li>Particle-Mesh: fastest, but only support dynamical range of \(10^3\).</li>

<li>P3M: higher spatial resolution, but significant increase in CPU time.</li>

<li>AP3M: rectangular grids is placed in clustered regions to apply PM
solver.</li>

<li>AMR: Generalization of both AP3M and TREE. e.g. ART.</li>
</ul>

<p>
N-body code:
</p>

<ul class="org-ul">
<li>ART:

<ul class="org-ul">
<li>The first implementation of a grid-based high-resolution N-body code.</li>

<li>AMR: recursively in a fully adaptive manner in the regions where the density exceeds a predefined threshold. Mean number of particles per cell remains roughly constant (around 10).</li>

<li>"Quasi-Lagrangian" approach ensures two-body relaxation remains unimportant.</li>

<li>The mesh structure is not created at every time step, but is properly adjusted to the evolving particle distribution.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-sec:ramses" class="outline-3">
<h3 id="sec:ramses"><span class="section-number-3">3.2</span> RAMSES</h3>
<div class="outline-text-3" id="text-sec:ramses">
</div>

<div id="outline-container-summary" class="outline-4">
<h4 id="summary"><span class="section-number-4">3.2.1</span> Summary</h4>
<div class="outline-text-4" id="text-summary">
<ul class="org-ul">
<li>The AMR grid is built on a tree structure.</li>

<li>The hydrodynamic solver is based on a second order Godunov method, to solve the Euler equation.</li>

<li>Refinement strategy retained for cosmological simulations is based on a "quasi-Lagrangian" mesh evolution.</li>
</ul>
</div>
</div>

<div id="outline-container-features" class="outline-4">
<h4 id="features"><span class="section-number-4">3.2.2</span> Features</h4>
<div class="outline-text-4" id="text-features">
<ul class="org-ul">
<li>Coupling a tree-based AMR hydrodynamical scheme to the N-body solver developed for the ART code.</li>

<li>Hydrodynamical solver: second-order Godunov scheme for perfect gases.</li>
</ul>
</div>
</div>

<div id="outline-container-m1-closure" class="outline-4">
<h4 id="m1-closure"><span class="section-number-4">3.2.3</span> M1 closure</h4>
<div class="outline-text-4" id="text-m1-closure">
<p>
Assume that the radiation field is locally a dipole. The photon distribution function is the Lorentz transform of a Planckian distribution. Dipole is aligned locally to the radiation flux.
</p>

<p>
Under M1, the radiative transfer equation is turned into an hyperbolic system of conservation laws with source terms.
</p>
</div>
</div>

<div id="outline-container-cooling-function" class="outline-4">
<h4 id="cooling-function"><span class="section-number-4">3.2.4</span> Cooling Function</h4>
<div class="outline-text-4" id="text-cooling-function">
<p>
Possibly a big issue!!! I see a mu=1.4 with comments: hard set mu=1.4 to make temperature agree with Audic &amp; Hennebelle.
</p>

<ol class="org-ol">
<li>For hydrogen and helium
<ol class="org-ol">
<li>In each cell, photoheating and radiative cooling of hydrogen and helium is performed by the radiative transfer module of RAMSES-RT as in Rosdahl et al. (2013).</li>
<li>Photoheating rate \(\mathcal{H}\) is a sum of the heating contributiosn from all photoionziation events (HI, HeI, and HeII).</li>
<li>The primordial cooling rate \(\mathcal{L}\) include various cooling processes: collisional ionizations, collisional excitations, recombinations, dielectronic recombinations, bremsstrahlung and Compton cooling.</li>
</ol></li>
<li>For metals
<ol class="org-ol">
<li>'Neutral' function N(T)
<ul class="org-ul">
<li>Below 10^4 K: the prescription of Audit &amp; Hennebelle (2005), which includes <b>carbon, oxygen and dust grains</b> as well as the <b>ambient UV background</b> in the ISM. This is based on the work of Wolfire et al. (1995, 2003).
<ul class="org-ul">
<li>Including cooling by
<ul class="org-ul">
<li>fine-structure lines of CII (92 K)</li>
<li>fine-structure lines of OI (228 and 326 K)</li>
<li>cooling by H (Lyα line)</li>
<li>cooling by electron recombination onto positively charged grains</li>
</ul></li>
<li>and heating by
<ul class="org-ul">
<li>photo-electric effect on small grains and PAHs due to the FUV galactic radiation.</li>
</ul></li>
<li>(This might be probmatic due to the hard mu = 1.4. In Audit2005, they have no radiative transfer, so the mean particle weight is constant at mu = 1.4, while in RAMSES RT, mu is much higher(lower?) due to ionized electrons.)</li>
</ul></li>
<li>Above \(10^4\) K: Sutherland &amp; Dopita (1993)</li>
</ul></li>
<li>'Photoionized' cooling function
<ul class="org-ul">
<li>a piecewise fit to Ferland (2003): \(\Lambda = 3\times10^{-24}~{\rm erg~cm^3~s^{-1}}\) below 9000 K and \(2.2\times10^{-22}~{\rm erg~cm^3~s^{-1}}\) above 10^5 K.</li>
</ul></li>
</ol></li>
<li>For H/He
<ul class="org-ul">
<li>&#x2026;</li>
</ul></li>
</ol>

<p>
TODO: make a curve of the cooling funciton
</p>
</div>

<div id="outline-container-orgf389363" class="outline-5">
<h5 id="orgf389363"><span class="section-number-5">3.2.4.1</span> Thermal update</h5>
<div class="outline-text-5" id="text-3-2-4-1">
<p>
\[
\frac{\partial e}{\partial t} = \Gamma \equiv {\cal H} + {\cal L}
\]
where \({\cal H}\) is the photoheating rate and \({\cal L}\) is the cooling rate.
</p>

<p>
The photoheating rate \({\cal H}\) is a sum of the heating contributions form all photoionization events, calculated with the discretization into M photon groups.
</p>

<p>
The various cooling processes are collisional ionizations/excitations, recombinations, dielectronic recombinations, bremsstrahlung, and Compton cooling.
</p>

<p>
<b>On-the-spot approximation</b> recombination-emitted photons are absorbed ‘on the spot’ by a near-lying atom (in the same cell), and hence these photon emissions cancel out by local photon absorptions. When OTSA is assumed, the gas is not photoemitting, and the case A recombination rates are replaced with case B recombination rates
</p>
</div>
</div>

<div id="outline-container-orgf89dfe9" class="outline-5">
<h5 id="orgf89dfe9"><span class="section-number-5">3.2.4.2</span> In code</h5>
<div class="outline-text-5" id="text-3-2-4-2">
<p>
<code>ramses/patch/frig/main/cooling_module_frig.f90</code>:
</p>
<ul class="org-ul">
<li>cooling_low(T, n, ref): low-T cooling</li>
<li>cooling_high(T, n, ref): high-T cooling</li>
</ul>
</div>
</div>

<div id="outline-container-orge644929" class="outline-5">
<h5 id="orge644929"><span class="section-number-5">3.2.4.3</span> Other notes</h5>
<div class="outline-text-5" id="text-3-2-4-3">
<p>
Mean particle mass, \(\mu\), is correctly calculated by the function <code>getMu</code> in main/rt_cooling_module.f90:
</p>

<p>
\[
\mu = [X(1+x_{\rm HII}) + \frac{Y}{4}(1 + x_{\rm HeII} + 2x_{\rm HeIII})]^{-1}
\]
Note that in the most basic H and He senario, we have \(1/\mu = X/1 + Y/4\). 
</p>
</div>
</div>
</div>
