files/astronomy/org/hydro-and-code.org
*** Sink particles

- IR feedback from accretion: exists in current version. Use ~ir_feedback~ under _Feedback parameters_. 

** N-body
   :PROPERTIES:
   :CUSTOM_ID: n-body
   :END:

The density field is computed using the 'Cloud-In-Cell' (CIC) interpolation scheme. The Poisson equation at the course level is solved using standard FFT technique. For fine levels, the potential is found using a relaxation method. The acceleration is then calculated using the 6-points finite difference approximation of the gradient. Variable time steps: a second-order midpoint scheme that reduces exactly to the leapfrog scheme for constant time steps.

** Hydro Codes
   :PROPERTIES:
   :CUSTOM_ID: hydro
   :END:

*** Fire

The FIRE simulations use the P-SPH code, a heavily modified version of Volker Springel’s Gadget 3 code whose development is led by Phil Hopkins. In addition to the explicit ISM and stellar feedback physics, P-SPH uses apressure-entropy implementation of smooth particle hydrodynamics (SPH) that resolves all the main historical discrepancies between grid-based and SPH methods, particularly for fluid mixing instabilities.

*** 
   
** Mock Observations
  :PROPERTIES:
  :CUSTOM_ID: observations
  :END:

*** Stellar population sythesis
   :PROPERTIES:
   :CUSTOM_ID: stellar-population-sythesis
   :END:

FSPS: Flexible Stellar Population Synthesis:
[[https://github.com/cconroy20/fsps]]

pythonFSPS (Flexible Stellar Population Synthesis for Python):
[[http://dfm.io/python-fsps/current/]]

Starburst99

- [[https://github.com/rjtanner/StarburstPy]]
- [[https://github.com/Morisset/pyStb99]]

[[https://users.astro.ufl.edu/~desika.narayanan/courses/ism_spring19/hw4.pdf]]

*** Filters
   :PROPERTIES:
   :CUSTOM_ID: filters
   :END:

JWST/NIRCam.F150W:
[[http://svo2.cab.inta-csic.es/svo/theory/fps3/index.php?id=JWST/NIRCam.F150W&&mode=browse&gname=JWST&gname2=NIRCam]]

Table of FSPS Filters: [[http://dfm.io/python-fsps/current/filters/]]

SDSS Filters on astroML:
[[https://www.astroml.org/book_figures/appendix/fig_sdss_filters.html]]

* Simulation Projects

** FIRE: Feedback In Realistic Environments

https://fire.northwestern.edu/


