files/astronomy/public/hydro-and-code.html

<div id="outline-container-org5fecfab" class="outline-4">
<h4 id="org5fecfab"><span class="section-number-4">3.2.5</span> Sink particles</h4>
<div class="outline-text-4" id="text-3-2-5">
<ul class="org-ul">
<li>IR feedback from accretion: exists in current version. Use <code>ir_feedback</code> under <span class="underline">Feedback parameters</span>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-n-body" class="outline-3">
<h3 id="n-body"><span class="section-number-3">3.3</span> N-body</h3>
<div class="outline-text-3" id="text-n-body">
<p>
The density field is computed using the 'Cloud-In-Cell' (CIC) interpolation scheme. The Poisson equation at the course level is solved using standard FFT technique. For fine levels, the potential is found using a relaxation method. The acceleration is then calculated using the 6-points finite difference approximation of the gradient. Variable time steps: a second-order midpoint scheme that reduces exactly to the leapfrog scheme for constant time steps.
</p>
</div>
</div>

<div id="outline-container-hydro" class="outline-3">
<h3 id="hydro"><span class="section-number-3">3.4</span> Hydro Codes</h3>
<div class="outline-text-3" id="text-hydro">
</div>

<div id="outline-container-orgb66a838" class="outline-4">
<h4 id="orgb66a838"><span class="section-number-4">3.4.1</span> Fire</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
The FIRE simulations use the P-SPH code, a heavily modified version of Volker Springel’s Gadget 3 code whose development is led by Phil Hopkins. In addition to the explicit ISM and stellar feedback physics, P-SPH uses apressure-entropy implementation of smooth particle hydrodynamics (SPH) that resolves all the main historical discrepancies between grid-based and SPH methods, particularly for fluid mixing instabilities.
</p>
</div>
</div>

<div id="outline-container-org677fc9a" class="outline-4">
<h4 id="org677fc9a"><span class="section-number-4">3.4.2</span> </h4>
</div>
</div>

<div id="outline-container-observations" class="outline-3">
<h3 id="observations"><span class="section-number-3">3.5</span> Mock Observations</h3>
<div class="outline-text-3" id="text-observations">
</div>

<div id="outline-container-stellar-population-sythesis" class="outline-4">
<h4 id="stellar-population-sythesis"><span class="section-number-4">3.5.1</span> Stellar population sythesis</h4>
<div class="outline-text-4" id="text-stellar-population-sythesis">
<p>
FSPS: Flexible Stellar Population Synthesis:
<a href="https://github.com/cconroy20/fsps">https://github.com/cconroy20/fsps</a>
</p>

<p>
pythonFSPS (Flexible Stellar Population Synthesis for Python):
<a href="http://dfm.io/python-fsps/current/">http://dfm.io/python-fsps/current/</a>
</p>

<p>
Starburst99
</p>

<ul class="org-ul">
<li><a href="https://github.com/rjtanner/StarburstPy">https://github.com/rjtanner/StarburstPy</a></li>
<li><a href="https://github.com/Morisset/pyStb99">https://github.com/Morisset/pyStb99</a></li>
</ul>

<p>
<a href="https://users.astro.ufl.edu/~desika.narayanan/courses/ism_spring19/hw4.pdf">https://users.astro.ufl.edu/~desika.narayanan/courses/ism_spring19/hw4.pdf</a>
</p>
</div>
</div>

<div id="outline-container-filters" class="outline-4">
<h4 id="filters"><span class="section-number-4">3.5.2</span> Filters</h4>
<div class="outline-text-4" id="text-filters">
<p>
JWST/NIRCam.F150W:
<a href="http://svo2.cab.inta-csic.es/svo/theory/fps3/index.php?id=JWST/NIRCam.F150W&amp;&amp;mode=browse&amp;gname=JWST&amp;gname2=NIRCam">http://svo2.cab.inta-csic.es/svo/theory/fps3/index.php?id=JWST/NIRCam.F150W&amp;&amp;mode=browse&amp;gname=JWST&amp;gname2=NIRCam</a>
</p>

<p>
Table of FSPS Filters: <a href="http://dfm.io/python-fsps/current/filters/">http://dfm.io/python-fsps/current/filters/</a>
</p>

<p>
SDSS Filters on astroML:
<a href="https://www.astroml.org/book_figures/appendix/fig_sdss_filters.html">https://www.astroml.org/book_figures/appendix/fig_sdss_filters.html</a>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org166d59f" class="outline-2">
<h2 id="org166d59f"><span class="section-number-2">4</span> Simulation Projects</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8fa54d5" class="outline-3">
<h3 id="org8fa54d5"><span class="section-number-3">4.1</span> FIRE: Feedback In Realistic Environments</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://fire.northwestern.edu/">https://fire.northwestern.edu/</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Author: ChongChong He</p><p></p><p><a href='https://www.astro.umd.edu/~chongchong/'>www.astro.umd.edu/~chongchong/</a></p>
</div>
</body>
</html>